In [2]:
import pandas as pd

### 병합
- 1. 인덱스 재할당 
- 2. 기존 인덱스 drop 
     - 2가지 실행 후 concat

In [3]:
# Sample DataFrames
df1 = pd.DataFrame({'A': [1, 'A_2', 3]}, index=[0, 1, 2])
df2 = pd.DataFrame({'B': [4, 'B_5', 6]}, index=[3, 4, 5])

In [4]:
df1

     A
0    1
1  A_2
2    3

In [5]:
df2

     B
3    4
4  B_5
5    6

In [6]:
pd.concat([df1, df2], axis=1) # 선 조치 필요

     A    B
0    1  NaN
1  A_2  NaN
2    3  NaN
3  NaN    4
4  NaN  B_5
5  NaN    6

In [7]:
df1.count(), df2.count() # 사이즈 확인

(A    3
 dtype: int64,
 B    3
 dtype: int64)

In [8]:
df1.reset_index() #인덱스 재할당

   index    A
0      0    1
1      1  A_2
2      2    3

In [9]:
df2.reset_index()

   index    B
0      3    4
1      4  B_5
2      5    6

In [10]:
pd.concat([df1.reset_index(),df2.reset_index()], axis=1) # 선 조치 필요 --> 실제 인덱스까지 병합됨

   index    A  index    B
0      0    1      3    4
1      1  A_2      4  B_5
2      2    3      5    6

In [11]:
df1_reset = df1.reset_index(drop=True) # 기존 인덱스 drop
df1_reset

     A
0    1
1  A_2
2    3

In [12]:
df2_reset = df2.reset_index(drop=True)
df2_reset

     B
0    4
1  B_5
2    6

In [13]:
pd.concat([df1_reset, df2_reset], axis=1)

     A    B
0    1    4
1  A_2  B_5
2    3    6

### null값

In [18]:
df3 = pd.DataFrame({'B': ['4', 'None', '6']}, index=[3, 4, 5])

In [19]:
df3.isnull()

       B
3  False
4  False
5  False

In [26]:
def convertSICK_SYM(sick_sym) :
    if len(sick_sym) < 3 : 
        return pd.NA #pd.NA(pandas) #np.Nan(numpy)            
    else : 
        return sick_sym[:3]

In [23]:
df3['B'] = df3['B'].apply(convertSICK_SYM)

In [24]:
df3

      B
3  None
4   Non
5  None

In [25]:
df3['B'].isnull()

3     True
4    False
5     True
Name: B, dtype: bool